Service - Income Tax/sample messages/ErrorCode2359.txt

Error code 2359

Request
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r6:fileRequest xmlns:r6="urn:www.ird.govt.nz/GWS:types/ReturnIR6.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">079945793</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2022-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>6</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r6:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r6:firstReturnEstateTrustStartDate>2018-05-28</r6:firstReturnEstateTrustStartDate>
                                <r6:estateTrustType>C</r6:estateTrustType>
                                <r6:interestIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r6:interestIncome>
                                <r6:dividendIncome>
                                    <ic:totalImputationCredits>10.00</ic:totalImputationCredits>
                                    <ic:totalRWTCredits>1000.00</ic:totalRWTCredits>
                                    <ic:totalGrossDividends>4000.00</ic:totalGrossDividends>
                                </r6:dividendIncome>
                                <r6:maoriAuthorityDistributions>
                                    <ic:totalMACredits>1000.00</ic:totalMACredits>
                                    <ic:totalMADistributions>1000.00</ic:totalMADistributions>
                                </r6:maoriAuthorityDistributions>
                                <r6:partnershipEstateTrustIncome>
                                    <ic:totalTaxCredits>6000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:partnershipEstateTrustIncome>
                                <r6:overseasIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>1000</ic:totalIncome>
                                </r6:overseasIncome>
                                <r6:pieIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:pieIncome>
                                <r6:ltcIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:ltcIncome>
                                <r6:ltcNonAllowableDeductions>0</r6:ltcNonAllowableDeductions>
                                <r6:ltcPriorYearNonAllowableDeductionsClaimed>0</r6:ltcPriorYearNonAllowableDeductionsClaimed>
                                <r6:ltcAdjustedIncome>1000.00</r6:ltcAdjustedIncome>
                                <r6:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r6:residentialRentalIncome>
                                <r6:propertyInterestLimitation>
                                    <ic:totalInterest>0.00</ic:totalInterest>
                                    <ic:interestExpenseClaimed>0.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>false</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>false</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>false</ic:loansDrawnDown>
                                        <ic:newBuildExemption>false</ic:newBuildExemption>
                                        <ic:developmentExemption>false</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>false</ic:emergencyTransitionalSocialCouncil>
                                    </ic:interestExpenseClaimedReason>
                                </r6:propertyInterestLimitation>
                                <r6:businessOrRentalIncome>1000.00</r6:businessOrRentalIncome>
                                <r6:otherIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:otherIncome>
                                <r6:saleOfProperty>1000.00</r6:saleOfProperty>
                                <r6:rlwtCredit>0</r6:rlwtCredit>
                                <r6:totalTaxCredits>11000.00</r6:totalTaxCredits>
                                <r6:beneficiaryIncome>5000.00</r6:beneficiaryIncome>
                                <r6:trusteeIncome>7000.00</r6:trusteeIncome>
                                <r6:totalExpensesClaimed>0</r6:totalExpensesClaimed>
                                <r6:lossesBroughtForward>0</r6:lossesBroughtForward>
                                <r6:lossesClaimedThisYear>0</r6:lossesClaimedThisYear>
                                <r6:lossCarriedBackPriorYear>0.00</r6:lossCarriedBackPriorYear>
                                <r6:totalDistributions>1000.00</r6:totalDistributions>
                                <r6:totalTaxableDistributions>0</r6:totalTaxableDistributions>
                                <r6:disclosureRequiredCFCorFIF>false</r6:disclosureRequiredCFCorFIF>
                                <r6:totalBeneficiaryTax>0</r6:totalBeneficiaryTax>
                                <r6:totalTrusteeIncome>7000</r6:totalTrusteeIncome>
                                <r6:taxOnTrusteeIncome>2310.00</r6:taxOnTrusteeIncome>
                                <r6:trusteeShareOfOverseasTaxPaid>0</r6:trusteeShareOfOverseasTaxPaid>
                                <r6:trusteeShareOfDivImpCredits>0</r6:trusteeShareOfDivImpCredits>
                                <r6:researchAndDevelopment>
                                    <ic:creditBroughtForward>0.00</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0.00</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0.00</ic:refundableCredit>
                                </r6:researchAndDevelopment>
                                <r6:trusteeShareOfTaxCredits>11000.00</r6:trusteeShareOfTaxCredits>
                                <r6:taxOnTrusteeIncomeLessCredits>-8690.00</r6:taxOnTrusteeIncomeLessCredits>
                                <r6:residualIncomeTax>-8690.00</r6:residualIncomeTax>
                                <r6:provisionalTax>
                                    <ic:provisionalTaxOption>EST</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2019-01-01</ic:provisionalTaxStartDate>
                                </r6:provisionalTax>
                                <r6:beneficiaryDetails>
                                    <ic:beneficiary>
                                        <ic:beneficiaryIrdNumber>111111111</ic:beneficiaryIrdNumber>
                                        <ic:taxIdNumber>123123123</ic:taxIdNumber>
                                        <ic:beneficiaryName>Joe Bloggs</ic:beneficiaryName>
                                        <ic:beneficiaryDOB>1985-09-01</ic:beneficiaryDOB>
                                        <ic:taxJurisdiction>AZ</ic:taxJurisdiction>
                                        <ic:noJurisdictionTin>false</ic:noJurisdictionTin>
                                        <ic:tinNotRequired>false</ic:tinNotRequired>
                                        <ic:beneficiaryAddress>1 Bloggs Way</ic:beneficiaryAddress>
                                        <ic:beneficiaryIsNonResident>true</ic:beneficiaryIsNonResident>
                                        <ic:shareOfInterestIncome>1000.00</ic:shareOfInterestIncome>
                                        <ic:shareOfDividendsIncome>1000.00</ic:shareOfDividendsIncome>
                                        <ic:shareOfMADistributionsIncome>1000.00</ic:shareOfMADistributionsIncome>
                                        <ic:shareOfOverseasIncome>1000.00</ic:shareOfOverseasIncome>
                                        <ic:shareOfOtherIncome>1000.00</ic:shareOfOtherIncome>
                                        <ic:taxableIncome>5000.00</ic:taxableIncome>
                                        <ic:taxPaidByTrust>true</ic:taxPaidByTrust>
                                        <ic:distributionByNonComplyingtrust>10.00</ic:distributionByNonComplyingtrust>
                                        <ic:taxOnTaxableIncome>850.50</ic:taxOnTaxableIncome>
                                        <ic:overseasTaxPaid>10.00</ic:overseasTaxPaid>
                                        <ic:taxLessOverseasTaxPaid>10.00</ic:taxLessOverseasTaxPaid>
                                        <ic:dividendImputationCredit>10.00</ic:dividendImputationCredit>
                                        <ic:taxLessDividendImputationCredit>10.00</ic:taxLessDividendImputationCredit>
                                        <ic:otherPaidTaxCredits>10.00</ic:otherPaidTaxCredits>
                                        <ic:taxLessOtherPaidTaxCredits>10.00</ic:taxLessOtherPaidTaxCredits>
                                        <ic:taxOnDistributionByNonComplyingTrust>10.00</ic:taxOnDistributionByNonComplyingTrust>
                                        <ic:beneficiaryTaxPayable>10.00</ic:beneficiaryTaxPayable>
                                        <ic:openingBalance>10.00</ic:openingBalance>
                                        <ic:accountingIncomeAllocated>10.00</ic:accountingIncomeAllocated>
                                        <ic:corpus>10.00</ic:corpus>
                                        <ic:capital>10.00</ic:capital>
                                        <ic:useOfTrustProperty>10.00</ic:useOfTrustProperty>
                                        <ic:distributionTrustAssets>10.00</ic:distributionTrustAssets>
                                        <ic:forgivenessOfDebt>10.00</ic:forgivenessOfDebt>
                                        <ic:withdrawnFromTrust>10.00</ic:withdrawnFromTrust>
                                        <ic:closingBalance>10.00</ic:closingBalance>
                                    </ic:beneficiary>
                                </r6:beneficiaryDetails>
                                <r6:settlementDetails>
                                    <ic:settlement>
                                        <ic:settlorFullName>First1 Settler</ic:settlorFullName>
                                        <ic:noSettlementThisYear>false</ic:noSettlementThisYear>
                                        <ic:settlorCommence>1985-09-01</ic:settlorCommence>
                                        <ic:taxJurisdiction>AZ</ic:taxJurisdiction>
                                        <ic:settlorIrdNumber>111111111</ic:settlorIrdNumber>
                                        <ic:taxIdNumber>123123123</ic:taxIdNumber>
                                        <ic:noJurisdictionTin>false</ic:noJurisdictionTin>
                                        <ic:tinNotRequired>false</ic:tinNotRequired>
                                        <ic:cash>0.00</ic:cash>
                                        <ic:financialArrangements>0.00</ic:financialArrangements>
                                        <ic:land>0.00</ic:land>
                                        <ic:buildings>0.00</ic:buildings>
                                        <ic:shares>0.00</ic:shares>
                                        <ic:services>0.00</ic:services>
                                        <ic:other>0.00</ic:other>
                                        <ic:otherDescription>Other Description</ic:otherDescription>
                                        <ic:settlementZeroValue>false</ic:settlementZeroValue>
                                    </ic:settlement>
                                </r6:settlementDetails>
                                <r6:exemptFromCompliance>false</r6:exemptFromCompliance>
                                <r6:netProfitLossBeforeTax>-10.00</r6:netProfitLossBeforeTax>
                                <r6:taxAdjustments>10.00</r6:taxAdjustments>
                                <r6:unTaxedRealisedGainsAndReceipts>20.00</r6:unTaxedRealisedGainsAndReceipts>
                                <r6:financialArrangements>0.00</r6:financialArrangements>
                                <r6:assetsLand>40.00</r6:assetsLand>
                                <r6:assetsLandValuation>H</r6:assetsLandValuation>
                                <r6:assetsBuildings>50.00</r6:assetsBuildings>
                                <r6:assetsBuildingsValuation>M</r6:assetsBuildingsValuation>
                                <r6:assetsShares>60.00</r6:assetsShares>
                                <r6:assetsSharesValuation>T</r6:assetsSharesValuation>
                                <r6:assetsTotal>150.00</r6:assetsTotal>
                                <r6:financialArrangementsLiable>10.00</r6:financialArrangementsLiable>
                                <r6:liabilitiesTotal>10.00</r6:liabilitiesTotal>
                                <r6:equityOwners>20.00</r6:equityOwners>
                                <r6:equityDrawings>20.00</r6:equityDrawings>
                                <r6:equityYearEndBalances>150.00</r6:equityYearEndBalances>
                            </rc:formFields>
                        </rc:fileBody>
                    </r6:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>

Response
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="1">https://services.ird.govt.nz/GWS/Returns/Return/FileResponse</wsa:Action>
    </s:Header>
    <s:Body>
        <FileResponse xmlns="https://services.ird.govt.nz/GWS/Returns/">
            <FileResult xmlns:d4p1="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <d4p1:FileResponseWrapper>
                    <fileResponse xmlns="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <statusMessage xmlns="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <statusCode>2359</statusCode>
                            <errorMessage>value of at least one of the following fields must be non-zero: cash, financialArrangements, land, buildings, shares, services, other</errorMessage>
                        </statusMessage>
                    </fileResponse>
                </d4p1:FileResponseWrapper>
            </FileResult>
        </FileResponse>
    </s:Body>
</s:Envelope>